{
  "schemaVersion": 1,
  "id": "boundless-botany",
  "version": "${version}",
  "name": "boundless botany",
  "description": "Boundless Botany is a Minecraft mod that customizes how plants can be placed in the world. This mod gives players the ability to configure which blocks plants can grow on, allowing for full control over their botanical surroundings. Players can choose which solid blocks, like grass, dirt, sand, and many more, are suitable for planting, creating a more personalized and controlled gardening experience.\n\nWith extensive configuration options, players can adjust the growth conditions of various plants, enabling them to have full control over the environment where their plants flourish.\n\nFeatures:\n- Custom plant configuration: Choose which plants can grow on specific blocks.\n- Block configuration: Define which solid blocks are suitable for plant placement, with the ability to enable or disable blocks.\n- Default settings: Includes the ability to configure all standard Minecraft plants such as flowers, grass, crops, and more.\n- Complete control over plants and blocks: Players can decide which plants can be placed on which blocks, making it perfect for those who want a more controlled and customized world.\n- User-friendly config screen: A simple and clear interface for configuring mod settings, making it easy for players to adjust their preferences.\n\nBoundless Botany adds an extra layer of customization and control to your Minecraft experience, making it perfect for players who want to fine-tune their world to the smallest detail.",
  "authors": [
    "Zabarion"
  ],
  "contact": {
    "sources": "https://github.com/FabricMC/fabric-example-mod"
  },
  "license": "CC0-1.0",
  "icon": "assets/boundless-botany/icon.png",
  "environment": "*",
  "entrypoints": {
    "main": [
      "boundless.botany.BoundlessBotany"
    ],
    "client": [
      "boundless.botany.BoundlessBotanyClient"
    ],
    "modmenu": [
      "boundless.botany.ModMenuIntegration"
    ]
  },
  "mixins": [
    "boundless-botany.mixins.json",
    {
      "config": "boundless-botany.client.mixins.json",
      "environment": "client"
    }
  ],
  "depends": {
    "fabricloader": ">=0.16.10",
    "minecraft": "~1.21.4",
    "java": ">=21",
    "fabric-api": "*"
  },
  "custom": {
    "modmenu": {
      "config_screen_factory": "boundless.botany.ModMenuIntegration"
    }
  },
  "suggests": {
    "another-mod": "*"
  }
}